---
kind: property
id: P:Autodesk.Revit.DB.FabricationRodInfo.RodCount
source: html/07514b71-387e-17e1-3aa8-2fcb79c2ce68.htm
---
# Autodesk.Revit.DB.FabricationRodInfo.RodCount Property

Gets the number of rods.

## Syntax (C#)
```csharp
public int RodCount { get; }
```